In [1]:
#python -m pip install ipython-sql run this in terminal
#python -m pip install psycopg2-binary

In [2]:
%load_ext sql

In [3]:
%env DATABASE_URL=postgresql://retail_user:Baua%401865@localhost:5432/retail_db

env: DATABASE_URL=postgresql://retail_user:Baua%401865@localhost:5432/retail_db

In [5]:
%%sql

SELECT * FROM orders LIMIT 10;

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT'),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (8, datetime.datetime(2013, 7, 25, 0, 0), 2911, 'PROCESSING'),
 (9, datetime.datetime(2013, 7, 25, 0, 0), 5657, 'PENDING_PAYMENT'),
 (10, datetime.datetime(2013, 7, 25, 0, 0), 5648, 'PENDING_PAYMENT')]

In [40]:
%%sql

CREATE TABLE courses (
    course_id SERIAL PRIMARY KEY,
    course_name VARCHAR(60),
    course_author VARCHAR(40),
    course_status VARCHAR(9),
    course_published_dt DATE
)

 * postgresql://retail_user:***@localhost:5432/retail_db
Done.

[]

In [41]:
%%sql

INSERT INTO courses (course_name, course_author, course_status, course_published_dt)
VALUES
    ('Programming using Python', 'Bob Dillon', 'published', '2020-09-30'),
    ('Data Engineering using Python', 'Bob Dillon', 'published', '2020-07-15'),
    ('Data Engineering using Scala', 'Elvis Presley', 'draft', null),
    ('Programming using Scala' , 'Elvis Presley' , 'published' , '2020-05-12'),
    ('Programming using Java' , 'Mike Jack' , 'inactive' , '2020-08-10'),
    ('Web Applications - Python Flask' , 'Bob Dillon' , 'inactive' , '2020-07-20'),
    ('Web Applications - Java Spring' , 'Bob Dillon' , 'draft' , null),
    ('Pipeline Orchestration - Python' , 'Bob Dillon' , 'draft' , null),
    ('Streaming Pipelines - Python' , 'Bob Dillon' , 'published' , '2020-10-05'),
    ('Web Applications - scala Play' , 'Elvis Presley' , 'inactive' , '2020-09-30'),
    ('Web Applications - Python Django' , 'Bob Dillon' , 'published' , '2020-06-23'),
    ('Server Automation - Ansible' , 'Uncle Sam' , 'published' , '2020-07-05');

 * postgresql://retail_user:***@localhost:5432/retail_db
12 rows affected.

[]

In [42]:
%%sql

SELECT * FROM courses;

 * postgresql://retail_user:***@localhost:5432/retail_db
12 rows affected.

[(1, 'Programming using Python', 'Bob Dillon', 'published', datetime.date(2020, 9, 30)),
 (2, 'Data Engineering using Python', 'Bob Dillon', 'published', datetime.date(2020, 7, 15)),
 (3, 'Data Engineering using Scala', 'Elvis Presley', 'draft', None),
 (4, 'Programming using Scala', 'Elvis Presley', 'published', datetime.date(2020, 5, 12)),
 (5, 'Programming using Java', 'Mike Jack', 'inactive', datetime.date(2020, 8, 10)),
 (6, 'Web Applications - Python Flask', 'Bob Dillon', 'inactive', datetime.date(2020, 7, 20)),
 (7, 'Web Applications - Java Spring', 'Bob Dillon', 'draft', None),
 (8, 'Pipeline Orchestration - Python', 'Bob Dillon', 'draft', None),
 (9, 'Streaming Pipelines - Python', 'Bob Dillon', 'published', datetime.date(2020, 10, 5)),
 (10, 'Web Applications - scala Play', 'Elvis Presley', 'inactive', datetime.date(2020, 9, 30)),
 (11, 'Web Applications - Python Django', 'Bob Dillon', 'published', datetime.date(2020, 6, 23)),
 (12, 'Server Automation - Ansible', 'Uncle Sam', 'published', datetime.date(2020, 7, 5))]

In [43]:
# -- Let us take care of exercises related to filtering and aggregations using SQL.
# -- * Get all the details of the courses which are in `inactive` or `draft` state.
# -- * Get all the details of the courses which are related to `Python` or `Scala`.
# -- * Get count of courses by `course_status`. The output should contain `course_status` and `course_count`.
# -- * Get count of `published` courses by `course_author`. The output should contain `course_author` and `course_count`.
# -- * Get all the details of `Python` or `Scala` related courses in `draft` status.

# -- * Get the author and count where the author have more than **one published** course. The output should contain `course_author` and `course_count`.

In [57]:
%%sql

-- * Get all the details of the courses which are in `inactive` or `draft` state.
SELECT * FROM courses where course_status IN ('draft','inactive');

 * postgresql://retail_user:***@localhost:5432/retail_db
6 rows affected.

[(3, 'Data Engineering using Scala', 'Elvis Presley', 'draft', None),
 (5, 'Programming using Java', 'Mike Jack', 'inactive', datetime.date(2020, 8, 10)),
 (6, 'Web Applications - Python Flask', 'Bob Dillon', 'inactive', datetime.date(2020, 7, 20)),
 (7, 'Web Applications - Java Spring', 'Bob Dillon', 'draft', None),
 (8, 'Pipeline Orchestration - Python', 'Bob Dillon', 'draft', None),
 (10, 'Web Applications - scala Play', 'Elvis Presley', 'inactive', datetime.date(2020, 9, 30))]

In [58]:
%%sql
 -- * Get all the details of the courses which are related to `Python` or `Scala`.
SELECT * FROM courses where UPPER(course_name) LIKE '%PYTHON%' or UPPER(course_name) LIKE '%SCALA%' ;

 * postgresql://retail_user:***@localhost:5432/retail_db
9 rows affected.

[(1, 'Programming using Python', 'Bob Dillon', 'published', datetime.date(2020, 9, 30)),
 (2, 'Data Engineering using Python', 'Bob Dillon', 'published', datetime.date(2020, 7, 15)),
 (3, 'Data Engineering using Scala', 'Elvis Presley', 'draft', None),
 (4, 'Programming using Scala', 'Elvis Presley', 'published', datetime.date(2020, 5, 12)),
 (6, 'Web Applications - Python Flask', 'Bob Dillon', 'inactive', datetime.date(2020, 7, 20)),
 (8, 'Pipeline Orchestration - Python', 'Bob Dillon', 'draft', None),
 (9, 'Streaming Pipelines - Python', 'Bob Dillon', 'published', datetime.date(2020, 10, 5)),
 (10, 'Web Applications - scala Play', 'Elvis Presley', 'inactive', datetime.date(2020, 9, 30)),
 (11, 'Web Applications - Python Django', 'Bob Dillon', 'published', datetime.date(2020, 6, 23))]

In [59]:
%%sql
-- * Get count of courses by `course_status`. The output should contain `course_status` and `course_count`.
SELECT course_status, count(*) AS course_count FROM courses GROUP BY course_status;

 * postgresql://retail_user:***@localhost:5432/retail_db
3 rows affected.

[('published', 6), ('inactive', 3), ('draft', 3)]

In [60]:
%%sql
-- * Get count of `published` courses by `course_author`. The output should contain `course_author` and `course_count`.
SELECT course_author,count(*) AS course_count FROM courses WHERE UPPER(course_status)='PUBLISHED' GROUP BY course_author;

 * postgresql://retail_user:***@localhost:5432/retail_db
3 rows affected.

[('Bob Dillon', 4), ('Elvis Presley', 1), ('Uncle Sam', 1)]

In [61]:
%%sql
-- * Get all the details of `Python` or `Scala` related courses in `draft` status.
SELECT * FROM courses where (UPPER(course_name) LIKE '%PYTHON%' or UPPER(course_name) LIKE '%SCALA%') AND UPPER(course_status)='DRAFT' ;

 * postgresql://retail_user:***@localhost:5432/retail_db
2 rows affected.

[(3, 'Data Engineering using Scala', 'Elvis Presley', 'draft', None),
 (8, 'Pipeline Orchestration - Python', 'Bob Dillon', 'draft', None)]

In [62]:
%%sql
 -- * Get the author and count where the author have more than **one published** course. The output should contain `course_author` and `course_count`.
SELECT course_author,count(*) AS course_count FROM courses WHERE UPPER(course_status)='PUBLISHED' GROUP BY course_author HAVING count(*)>1;

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[('Bob Dillon', 4)]